Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.1.26/Microchip.SAML22_DFP.pdsc
      <condition id="ATSAML22G18A">
         <require Dvendor="Microchip:3" Dname="ATSAML22G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML22J17A">
         <require Dvendor="Microchip:3" Dname="ATSAML22J17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML22G17A">
         <require Dvendor="Microchip:3" Dname="ATSAML22G17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML22N18A">
         <require Dvendor="Microchip:3" Dname="ATSAML22N18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML22N17A">
         <require Dvendor="Microchip:3" Dname="ATSAML22N17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML22J18A">
         <require Dvendor="Microchip:3" Dname="ATSAML22J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML22G16A">
         <require Dvendor="Microchip:3" Dname="ATSAML22G16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22J16A">
         <description>Headers and startup code for Microchip ATSAML22J16A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22j16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22j16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22j16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22j16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22j16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22j16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22j16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22j16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22j16a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22j16a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22N16A">
         <description>Headers and startup code for Microchip ATSAML22N16A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22n16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22n16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22n16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22n16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22n16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22n16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22n16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22n16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22n16a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22n16a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22G18A">
         <description>Headers and startup code for Microchip ATSAML22G18A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22g18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22g18a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22g18a/flash.icf" attr="config"/>
         </files>
      </component>
