Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.1.26/Microchip.SAML22_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22J17A">
         <description>Headers and startup code for Microchip ATSAML22J17A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22j17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22j17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22j17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22j17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22j17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22j17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22j17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22j17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22j17a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22j17a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22G17A">
         <description>Headers and startup code for Microchip ATSAML22G17A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22g17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22g17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22g17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22g17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22g17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22g17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22g17a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22g17a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22N18A">
         <description>Headers and startup code for Microchip ATSAML22N18A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22n18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22n18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22n18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22n18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22n18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22n18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22n18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22n18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22n18a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22n18a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22N17A">
         <description>Headers and startup code for Microchip ATSAML22N17A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22n17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22n17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22n17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22n17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22n17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22n17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22n17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22n17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22n17a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22n17a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22J18A">
         <description>Headers and startup code for Microchip ATSAML22J18A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22j18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22j18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22j18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22j18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22j18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22j18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22j18a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22j18a/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="ATSAML22G16A">
         <description>Headers and startup code for Microchip ATSAML22G16A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_saml22g16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_saml22g16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/saml22g16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/saml22g16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_saml22g16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_saml22g16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_saml22g16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_saml22g16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsaml22g16a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsaml22g16a/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
